SnyUmd/Arduino_ESP32/Hct/Hct201_After/src/hctMain.cpp
void wifiStatusReset()
{
    EEP_Write(ep, wifiSts.eep_address_ssid ,SSID);
    EEP_Write(ep, wifiSts.eep_address_pass ,PASS);
    EEP_Write(ep, wifiSts.eep_address_host_name ,HOST_NAME);
    sr.println("Reset wifi status");
}

// *************************************
void modeSetting()
{
    BluetoothSerial srBT;
    HardwareSerial Serial00 = Serial;

    sr.println("********* Setting mode *********");
    BzGoDown(5, 10);
    digitalWrite(PORT_LED_W, LED_ON);
    // digitalWrite(PORT_LED_F, LED_ON);

    //Bluetoothのセット--------------------
    // if (!mESP32_BLSerial_Set(srBT, "BT_um", Serial00))
    if(!srBT.begin("BT32"))
    {
        //digitalWrite(BLUE_LED, 0);
        sr.print("-----Bluetooth err-----");
        while (true);
    }
    else
    {
        sr.print("-----Bluetooth set-----");

        //digitalWrite(BLUE_LED, 1);
    }
    String readBuf = "";

    while (true)
    {
        int writeNum = 0;
        int* p_address;
        String* p_sBuf;

        srBT.println("==================");
        srBT.println("wifi start : s");
        srBT.println("wifi status read : r");
        srBT.println("wifi status write : w");
        srBT.println("------------------");
        srBT.print("-> ");
        
        readBuf = serialRead(srBT, '\n');
        if(readBuf.indexOf(BTcommand[enm_start]) >= 0) break;
        else if(readBuf.indexOf(BTcommand[enm_read]) >= 0)
        {
            srBT.print("ssid : ");
            srBT.println(wifiSts.ssid);
            srBT.print("pass : ");
            srBT.println(wifiSts.pass);
            srBT.print("hostname : ");
            srBT.println(wifiSts.host_name);
            srBT.println("");
        }
        else if(readBuf.indexOf(BTcommand[enm_write]) >= 0)
        {
            srBT.println("ssid : 1");
            srBT.println("pass : 2");
            srBT.println("hostname : 3");
            srBT.println("------------------");
            srBT.print("number -> ");
            readBuf = serialRead(srBT, '\n');
            if(readBuf == "1")
            {
                // writeNum = 0;
                p_address = &wifiSts.eep_address_ssid;
                p_sBuf = &wifiSts.ssid;
            }
            else if(readBuf == "2"){
                p_address = &wifiSts.eep_address_pass;
                p_sBuf = &wifiSts.pass;
            } 
            else if(readBuf == "3")
            {
                p_address = &wifiSts.eep_address_host_name;
                p_sBuf = &wifiSts.host_name;
            }
            
            // srBT.println(*p_address);
            // srBT.println(*p_sBuf);
            srBT.println("------------------");
            srBT.print("value -> ");
            readBuf = serialRead(srBT, '\n');
            if(readBuf == "") continue;
            else
            {
                EEP_Write(ep, *p_address, readBuf);
                *p_sBuf = readBuf;
                srBT.println("completion");
            }
        }
    }

    
    digitalWrite(PORT_LED_W, LED_OFF);
    digitalWrite(PORT_LED_F, LED_OFF);
}


//*************************************
String serialRead(BluetoothSerial& srBT ,char c_end)
{
    String result = "";
    while (true)
    {
        if(srBT.available())
        {
            result += srBT.readString();
            if(result.indexOf(c_end) >= 0)
            {
                result.remove(result.length()-2, 2);//crlfを削除
                return result;
            }
        }
    }
}

//*************************************
//現在時刻取得
void outputTime()
{
    bzReceivedRing();
    struct tm nowTime = getTimeInf();
    char s[20] = {};
    arrangeTime(s, nowTime);
    server.send(200, "text/plain", s);
}